
var commonOptions=['一點也不','有一點','有些','相當','非常'],
	quizPool={
		G1:{quiz:'工作雇用狀態',options:['全職','兼職','家庭主婦','失業','退休','殘障不能就業']},
		G2:{quiz:'婚姻狀態',options:['已婚或同居','未婚','分居','離婚','喪偶']},
		G3:{quiz:'生活居住情形',options:['獨居','與成人一同居住(無兒童)','與其他成人與兒童共同居住','只與兒童一同居住']},
		GP1:{quiz:'我精神不好'},
		GP2:{quiz:'我有噁心反胃的情形'},
		GP3:{quiz:'因為我的身體狀況，我有困難達到家人的需求'},
		GP4:{quiz:'我有疼痛'},
		GP5:{quiz:'我對治療的副作用感到困擾'},
		GP6:{quiz:'我覺得身體不適'},
		GP7:{quiz:'我因病被迫要臥床休息'},
		GS1:{quiz:'我覺得與我的朋友親近'},
		GS2:{quiz:'我從我家人獲得情緒上的支持'},
		GS3:{quiz:'我從我朋友獲得支持'},
		GS4:{quiz:'我家人已接受我的疾病'},
		GS5:{quiz:'我滿意家人之間對我疾病的溝通方式'},
		GS6:{quiz:'我覺得與我的伴侶(或我主要支持者)親近'},
		GS7:{quiz:'我對我的性生活感到滿意'},
		GE1:{quiz:'我感到悲傷'},
		GE2:{quiz:'我滿意自己處理疾病的方式'},
		GE3:{quiz:'我逐漸失去對抗我的疾病的希望'},
		GE4:{quiz:'我覺得緊張'},
		GE5:{quiz:'我擔心死亡'},
		GE6:{quiz:'我擔心我的狀況會惡化'},
		GF1:{quiz:'我能夠工作(包括在家的工作)'},
		GF2:{quiz:'我的工作(包括在家的工作)令人滿意'},
		GF3:{quiz:'我能夠享受生活'},
		GF4:{quiz:'我已接受我的疾病'},
		GF5:{quiz:'我睡得好'},
		GF6:{quiz:'我依然享受我以前常做的有趣的事'},
		GF7:{quiz:'我滿足我現在的生活品質'},
		E1:{quiz:'我最近三個月的平均收入每個月約新台幣',options:['無收入','0-10,000元','10,001-30,000元','30,001-50,000元','50,001-100,000元','100,000-200,000元','大於200,000元']},
		E2:{quiz:'我最近三個月平均每日工作時數約',options:['無','0-2.0小時','2.1-4.0小時','4.1-8.0小時','8.1-10.0小時','大於10.1小時']},
		E3:{quiz:'我最近三個月可支配自由使用的錢約有',options:['無收入','0-10,000元','10,001-30,000元','30,001-50,000元','50,001-100,000元','100,000-200,000元','大於200,000元']},
		B1:{quiz:'我呼吸時曾有氣不足'},
		B2:{quiz:'我在意自己的衣服穿著'},
		B3:{quiz:'我有一側或兩側的手臂腫脹或疼痛'},
		B4:{quiz:'我覺得自己是性感的'},
		B5:{quiz:'我對失去頭髮感到困擾'},
		B6:{quiz:'我擔心其他家人也會有得跟我同樣疾病的風險'},
		B7:{quiz:'我擔心壓力會影響到我的疾病'},
		B8:{quiz:'我對體重的改變感到困擾'},
		B9:{quiz:'我能夠覺得自己像個女人'},
		P2:{quiz:'我感到身體的某些部位有疼痛的症狀'},
		_PART_OF_PAIN:{quiz:'疼痛的部位',options:['沒有疼痛','頭頸部','身體','身體加頭頸部']},
		_SCORE_OF_PAIN:{quiz:'疼痛十分量表',options:[1,2,3,4,5,6,7,8,9,10]}
	},
	foreword_view=_.template('<hr/><small class="text-danger"><%= foreword %></small>'),
	quiz_view=_.template(
			'<hr/><h4><%= idx %>. <%= quiz %></h4>'+
			'<div class="col-lg-12">'+
			'<%_.forEach(options, function (o,i) {%>'+
			'	<label class="checkbox-inline"><input type="radio" name="<%= name %>" value="<%= i %>"/> <%= o %></label>'+
			'<%});%>'+
			'<label class="checkbox-inline"><input type="radio" name="<%= name %>" value="-1"/> 不想回答</label>'+
			'</div>'
		);